Revit 2016 API
WallFoundation.WallId Property
 Returns the host wall Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public ElementId WallId { get; }
Visual Basic
Public ReadOnly Property WallId As ElementId
	Get
Visual C++
public:
property ElementId^ WallId {
	ElementId^ get ();
}
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace